# GetActivePredefinedSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportDWGSettings..::..GetActivePredefinedSettings Method
ExportDWGSettings Class See Also
---
Returns the active pre-defined non-in-session exporting settings for DWG in the given document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static ExportDWGSettings GetActivePredefinedSettings(
	Document aDoc
)
```

Visual Basic
---
```text
Public Shared Function GetActivePredefinedSettings ( _
	aDoc As Document _
) As ExportDWGSettings
```

Visual C++
---
```text
public:
static ExportDWGSettings^ GetActivePredefinedSettings(
	Document^ aDoc
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document A Revit document to retrieve the active pre-defined exporting settings for DWG.
# ### Return Value
The active pre-defined exporting settings for DWG, or null if nothing pre-defined exists or the in-session settings is selected.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportDWGSettings Class
Autodesk.Revit.DB Namespace